artillery/scenarios/add-rides.yml
config:
  target: "http://localhost:8010"
  phases:
    - duration: 30
      arrivalRate: 100
  ensure:
    p99: 50
  variables:
scenarios:
  - name: Add a Ride Detail
    flow:
      - post:
          url: "/rides/"
          json:
            start_lat: 50
            start_long: 50
            end_lat: 50
            end_long: 50
            rider_name: "John Rider"
            driver_name: "John Driver"
            driver_vehicle: "Foo Vehicle"